package Memory_In_Java;

public class Main {
    public static void main(String[] args) {
        //## Задание 5
        //
        //Напишите метод, который изменяет значение переменной типа int.
        // Объявите метод changeValue, который принимает параметр типа int под названием value.
        // Внутри метода с помощью оператора присваивания запишите в параметр значение 22.
        //
        //В методе main объявите переменную типа int под названием value и запишите туда значение 33.
        // В следующей строке вызовите метод changeValue и передайте в него эту переменную.
        //
        //<aside>
        //<img src="https://s3-us-west-2.amazonaws.com/secure.notion-static.com/951dd6c4-3c4b-4fd2-a5f5-8ca392cfbdf0/С
        // нимок_экрана_2022-01-20_в_15.12.50.png" alt="https://s3-us-west-2.amazonaws.com/secure.notion-static.
        // com/951dd6c4-3c4b-4fd2-a5f5-8ca392cfbdf0/Снимок_экрана_2022-01-20_в_15.12.50.png" width="40px" /> **
        // Вопрос**: если распечатать переменную в методе main, то какое у нее будет значение?
        //
        //Поясните почему.
        //
        //</aside>
        //
        //*На платформу пришлите ответ на вопрос выше.  Код вашего решения присылать на платформу не нужно.*
        //
        //- Критерии оценки
        //    - В ответе указано верное значение переменной.
        //    - Ответ на вопрос из задачи аргументирован.
        //
        //## Задание 6
        //
        //Напишите метод, который изменяет значение переменной типа Integer. Объявите метод changeValue,
        // который принимает параметр типа Integer под названием value. Внутри метода с помощью оператора
        // присваивания запишите в параметр значение 22.
        //
        //В методе main объявите переменную типа Integer под названием value и запишите туда значение 33.
        // В следующей строке вызовите метод changeValue и передайте в него эту переменную.
        //
        //<aside>
        //<img src="https://s3-us-west-2.amazonaws.com/secure.notion-static.com/f41ae32a-5734-4843-812d
        // -adc498ea751c/Снимок_экрана_2022-01-20_в_15.12.50.png" alt="https://s3-us-west-2.amazonaws.
        // com/secure.notion-static.com/f41ae32a-5734-4843-812d-adc498ea751c/Снимок_экрана_2022-01-20_в_
        // 15.12.50.png" width="40px" /> **Вопрос**: если распечатать переменную в методе main, то какое
        // у нее будет значение?
        //
        //Поясните почему.
        //
        //Сравните и проанализируйте результаты задач 5 и 6, дайте свою оценку.
        //
        //</aside>
        //
        //*На платформу пришлите ответы на вопросы выше.   Код вашего решения присылать на платформу не нужно.*
        //
        //- Критерии оценки
        //    - В ответе указано верное значение переменной.
        //    - Ответ на вопрос из задачи аргументирован.
        //
        //
        //## **Задание 7**
        //
        //Напишите метод, который изменяет значение массива типа Integer. Объявите метод changeValue, ко
        // торый принимает параметр массива типа Integer под названием value. Внутри метода с помощью опе
        // ратора присваивания запишите в параметр новый массив {1,2}.
        //
        //В методе main объявите массив типа Integer под названием value и запишите туда значение {3,4}.
        // В следующей строке вызовите метод changeValue и передайте в него этот массив.
        //
        //<aside>
        //<img src="https://s3-us-west-2.amazonaws.com/secure.notion-static.com/70b1a030-4e31-49a3-b565-4
        // 5f9f1815ef8/Снимок_экрана_2022-01-20_в_15.12.50.png" alt="https://s3-us-west-2.amazonaws.com/s
        // ecure.notion-static.com/70b1a030-4e31-49a3-b565-45f9f1815ef8/Снимок_экрана_2022-01-20_в_15.12.
        // 50.png" width="40px" /> **Вопрос**: если распечатать массив в методе main, то какие у него будут значения?
        //
        //Поясните почему.
        //
        //</aside>
        //
        //*На платформу пришлите ответы на вопросы выше.   Код вашего решения присылать на платформу не нужно.*
        //
        //- Критерии оценки
        //    - В ответе указано верное значение переменной.
        //    - Ответ на вопрос из задачи аргументирован.
        //
        //
        //## **Задание 8**
        //
        //Напишите метод, который изменяет значение массива типа Integer. Объявите метод changeValue, кот
        // орый принимает параметр массива типа Integer под названием value. Внутри метода с помощью опера
        // тора присваивания запишите в первую ячейку параметра цифру 99.
        //
        //В методе main объявите массив типа Integer под названием value и запишите туда значение {3,4}
        // . В следующей строке вызовите метод changeValue и передайте в него этот массив.
        //
        //<aside>
        //<img src="https://s3-us-west-2.amazonaws.com/secure.notion-static.com/49128106-9fd3-43c2-ab0a-
        // 9abb65b31da6/Снимок_экрана_2022-01-20_в_15.12.50.png" alt="https://s3-us-west-2.amazonaws.com
        // /secure.notion-static.com/49128106-9fd3-43c2-ab0a-9abb65b31da6/Снимок_экрана_2022-01-20_в_15.
        // 12.50.png" width="40px" /> **Вопрос**: если распечатать массив в методе main, то какие у него будут значения?
        //
        //Поясните почему.
        //
        //Сравните и проанализируйте результаты задач 7 и 8 и дайте свою оценку.
        //
        //</aside>
        //
        //*На платформу пришлите ответы на вопросы выше.   Код вашего решения присылать на платформу не нужно.*
        //
        //- Критерии оценки
        //    - В ответе указано верное значение переменной.
        //    - Ответ на вопрос из задачи аргументирован.
        //
        //
        //## **Задание 9**
        //
        //Объявите объект класса person с полями name и surname. Переопределите у него метод toString т
        // ак, чтобы он возвращал строку из name и surname. Объявите метод changePerson, который приним
        // ает параметр типа Person под названием person. Внутри метода с помощью оператора присваивани
        // я запишите в параметр новый объект типа Person. Присвойте строке name значение Ilya, строке s
        // urname — значение Lagutenko.
        //
        //В методе main объявите переменную типа Person под названием person и запишите новый объект ти
        // па Person. Присвойте строке name значение Lyapis, строке surname значение — Trubetskoy.
        //
        //В следующей строке вызовите метод changePerson и передайте в него эту переменную.
        //
        //<aside>
        //<img src="https://s3-us-west-2.amazonaws.com/secure.notion-static.com/a8b946f1-9553-4d45-aa6
        // f-028fb9085d18/Снимок_экрана_2022-01-20_в_15.12.50.png" alt="https://s3-us-west-2.amazonaws
        // .com/secure.notion-static.com/a8b946f1-9553-4d45-aa6f-028fb9085d18/Снимок_экрана_2022-01-20
        // _в_15.12.50.png" width="40px" /> **Вопрос**: если распечатать переменную в методе main, то
        // какое у нее будет значение?
        //

        //Поясните почему.
        //
        //</aside>
        //
        //*На платформу пришлите ответы на вопросы выше.   Код вашего решения присылать на платформу не нужно.*
        //
        //- Критерии оценки
        //    - В ответе указано верное значение переменной.
        //    - Ответ на вопрос из задачи аргументирован.
        //
        //
        //## Задание 10
        //
        //Объявите объект класса person с полями name и surname. Переопределите у него метод toStrin
        // g так, чтобы он возвращал строку из name и surname. Объявите метод changePerson, который прин
        // имает параметр типа Person под названием person. Внутри метода запишите в поле name строку “Il
        // ya”, а в строку surname — “Lagutenko”.
        //
        //В методе main объявите переменную типа Person под названием person и запишите новый объект
        // типа Person. Присвойте значение имени Lyapis, фамилии — Trubetskoy.
        //
        //В следующей строке вызовите метод changePerson и передайте в него эту переменную.
        //
        //<aside>
        //<img src="https://s3-us-west-2.amazonaws.com/secure.notion-static.com/45c91acc-a0c4-4c64-
        // a3e9-ec49bf5a5d11/Снимок_экрана_2022-01-20_в_15.12.50.png" alt="https://s3-us-west-2.ama
        // zonaws.com/secure.notion-static.com/45c91acc-a0c4-4c64-a3e9-ec49bf5a5d11/Снимок_экрана_20
        // 22-01-20_в_15.12.50.png" width="40px" /> **Вопрос**: если распечатать переменную в методе m
        // ain, то какое у нее будет значение?
        //
        //Поясните почему.
        //
        //Сравните и проанализируйте результаты задач 9 и 10 и дайте свою оценку.
        //
        //</aside>
        //
        //*На платформу пришлите ответы на вопросы выше.   Код вашего решения присылать на платформу не нужно.*
        //
        //- Критерии оценки
        //    - В ответе указано верное значение переменной.
        //    - Ответ на вопрос из задачи аргументирован.
    }
}